Revit 2027 API
BuiltInFailures.GeneralFailures.NameInUse Property
 The name "[Name]" is already in use.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NameInUse { get; }
Public Shared ReadOnly Property NameInUse As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NameInUse {
	FailureDefinitionId^ get ();
}
static member NameInUse : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace